Repository: rheni9/arcanum-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uk

source: Password
uk: Пароль

source: Please enter your password.
uk: Будь ласка, введи свій пароль.

source: Sign In
uk: Вхід

source: Chat Name
uk: Назва чату

source: Chat name is required.
uk: Потрібно вказати назву чату.

source: Type
uk: Тип

source: Link
uk: Посилання

source: Please enter a valid URL starting with http:// or https://.
uk: Введи дійсну URL-адресу, що починається з http:// або https://.

source: Chat ID
uk: ID чату

source: Chat ID must be a positive integer.
uk: ID чату має бути додатним цілим числом.

source: Chat Image
uk: Зображення чату

source: Invalid image file or unsupported format.
uk: Файл зображення некоректний або формат не підтримується.

source: Join Date
uk: Дата приєднання

source: Active
uk: Активний

source: Member
uk: Учасник

source: Public
uk: Публічний

source: Notes
uk: Примітки

source: Save
uk: Зберегти

source: Chat link must start with 'http://' or 'https://'.
uk: Посилання має починатися з «http://» або «https://».

source: Join date cannot be in the future.
uk: Дата приєднання не може бути в майбутньому.

source: Image upload failed.
uk: Не вдалося завантажити зображення.

source: Text cannot be empty or whitespace.
uk: Текст не може бути порожнім або складатися лише з пробілів.

source: Message ID
uk: ID повідомлення

source: Message ID must be a positive integer.
uk: ID повідомлення має бути додатним цілим числом.

source: Date
uk: Дата

source: Date is required.
uk: Потрібно вказати дату.

source: Time
uk: Час

source: Time is required.
uk: Потрібно вказати час.

source: Message Link
uk: Посилання на повідомлення

source: Text
uk: Текст

source: Media
uk: Медіафайли

source: Screenshot
uk: Знімок екрана

source: Tags
uk: Теги

source: Date and time cannot be in the future.
uk: Дата і час не можуть бути в майбутньому.

source: Message link must start with 'http://' or 'https://'.
uk: Посилання має починатися з «http://» або «https://».

source: You can upload up to 5 files only.
uk: Можеш завантажити не більше 5 файлів.

source: One or more media files could not be uploaded.
uk: Не вдалося завантажити один або кілька медіафайлів.

source: Screenshot upload failed.
uk: Не вдалося завантажити знімок екрана

source: You have been logged in successfully.
uk: Вхід виконано успішно.

source: Password is incorrect.
uk: Неправильний пароль.

source: You have been logged out successfully.
uk: Вихід виконано успішно.

source: Database error: %(err)s
uk: Помилка бази даних: %(err)s

source: Chat with slug '%(slug)s' not found.
uk: Чат з ідентифікатором «%(slug)s» не знайдено.

source: Chat '%(name)s' created successfully.
uk: Чат «%(name)s» успішно створено.

source: This Telegram ID is already in use. Please check the value.
uk: Цей Telegram ID вже використовується. Перевір значення.

source: Slug already exists. Please choose another name.
uk: Такий ідентифікатор уже існує. Вибери іншу назву.

source: Failed to create chat: %(err)s
uk: Не вдалося створити чат: %(err)s

source: Chat '%(name)s' updated successfully.
uk: Чат «%(name)s» успішно оновлено.

source: Failed to update chat: %(err)s
uk: Не вдалося оновити чат: %(err)s

source: Chat '%(name)s' deleted successfully.
uk: Чат «%(name)s» успішно видалено.

source: Failed to delete chat: %(err)s
uk: Не вдалося видалити чат: %(err)s

source: Could not find matching image for removal.
uk: Не вдалося знайти відповідне зображення для видалення.

source: Chat image removed.
uk: Зображення чату видалено.

source: Failed to remove chat image.
uk: Не вдалося видалити зображення чату.

source: Message not found in this chat.
uk: Повідомлення не знайдено в цьому чаті.

source: Message added successfully.
uk: Повідомлення успішно додано.

source: This Message ID is already in use in this chat. Please check the value.
uk: Цей ID повідомлення уже використовується в цьому чаті. Перевір значення.

source: Failed to add message: %(err)s
uk: Не вдалося додати повідомлення: %(err)s

source: Message updated successfully.
uk: Повідомлення успішно оновлено.

source: Message not found for update.
uk: Повідомлення не знайдено для оновлення.

source: Failed to update message: %(err)s
uk: Не вдалося оновити повідомлення: %(err)s

source: Message deleted successfully.
uk: Повідомлення успішно видалено.

source: Failed to delete message: %(err)s
uk: Не вдалося видалити повідомлення: %(err)s

source: Missing media URL for deletion.
uk: Відсутня URL-адреса медіафайла для видалення.

source: Could not find matching media for removal.
uk: Не знайдено відповідного медіафайла для видалення.

source: Media file removed.
uk: Медіафайл видалено.

source: Failed to remove media file.
uk: Не вдалося видалити медіафайл.

source: Could not find matching screenshot for removal.
uk: Не вдалося знайти відповідний знімок екрана для видалення.

source: Screenshot removed.
uk: Знімок екрана видалено

source: Failed to remove screenshot.
uk: Не вдалося видалити знімок екрана.

source: Database error occurred. Please try again.
uk: Сталася помилка бази даних. Спробуй ще раз

source: Unknown
uk: Невідомо

source: Use the search bar or date filters above to find messages.
uk: Скористайся рядком пошуку або фільтрами за датою вище, щоб знайти повідомлення.

source: Dashboard
uk: Кабінет

source: Select a section to explore your saved content
uk: Вибери розділ, щоб переглянути збережений вміст

source: Chats icon
uk: Значок чатів

source: Messages
uk: Повідомлення

source: Error
uk: Помилка

source: Oops... Something went wrong
uk: Ой... Щось пішло не так

source: Error icon
uk: Значок помилки

source: Back to Home
uk: На головну

source: Go to Dashboard
uk: У кабінет

source: Home
uk: Головна

source: Welcome to Arcanum
uk: Вітаємо в Arcanum

source: Your private space
uk: Твій особистий простір

source: Access requires authorization
uk: Для доступу потрібно увійти

source: Lock icon
uk: Значок замка

source: Sign in
uk: Увійти

source: Required field
uk: Обов’язкове поле

source: Logo icon
uk: Значок логотипа

source: Slug
uk: Ідентифікатор

source: External link
uk: Зовнішнє посилання

source: Joined
uk: Дата приєднання

source: Total messages
uk: Усього повідомлень

source: Status
uk: Статус

source: Inactive
uk: Неактивний

source: Yes
uk: Так

source: No
uk: Ні

source: Chat
uk: Чат

# message_count_tooltip
source: Number of messages
uk: Кількість повідомлень

# message_count_header
source: Messages
uk: Повідомлень

# message_count_header_short
source: Msgs
uk: Повід.

# last_message_tooltip
source: Last message
uk: Час останнього повідомлення

# last_message_header
source: Last message
uk: Останнє

source: No messages
uk: Без повідомлень

source: Number of chats:
uk: Кількість чатів:

source: Number of messages:
uk: Кількість повідомлень:

source: Messages with media:
uk: Повідомлень з медіа:

source: Most active chat:
uk: Найактивніший чат:

source: message
uk: повідомлення

source: Last message timestamp:
uk: Час останнього повідомлення:

source: Message text
uk: Текст повідомлення

source: Sent
uk: Надіслано

source: Edit Chat
uk: Редагувати чат

source: Add Chat
uk: Додати чат

source: Add a New Chat
uk: Додати новий чат

source: Must start with http:// or https://
uk: Посилання має починатися з http:// або https://.

source: Only positive digits, like 1234567890
uk: Поле має містити лише додатні числа, наприклад 1234567890

source: Supported: JPG, PNG, GIF, WEBP, BMP, TIFF
uk: Підтримуються: JPG, PNG, GIF, WEBP, BMP, TIFF.

source: Mark chat as active
uk: Позначити чат як активний

source: Mark as member of chat
uk: Позначити, що є учасником цього чату

source: Mark chat as public
uk: Позначити чат як публічний

source: Update
uk: Оновити

source: Create
uk: Створити

source: Cancel
uk: Скасувати

source: Chats
uk: Чати

source: Chat Avatar
uk: Зображення чату

source: Back
uk: Назад

source: Back to Chats
uk: Назад до чатів

source: Add Message
uk: Додати повідомлення

source: Edit
uk: Редагувати

source: Delete
uk: Видалити

source: Search results
uk: Результати пошуку

source: for
uk: для

source: for tag
uk: за тегом

source: on
uk: за

source: before
uk: до

source: after
uk: після

source: between
uk: між

source: and
uk: і

source: message found.
uk: повідомлення знайдено.

source: No messages found
uk: Не знайдено повідомлень

source: No messages in this chat.
uk: У цьому чаті немає повідомлень.

source: Search messages...
uk: Пошук повідомлень...

source: Search icon
uk: Значок пошуку

source: Search
uk: Пошук

source: Select
uk: Обрати

source: On
uk: У день

source: Before
uk: До

source: After
uk: Після

source: Between
uk: Між

source: Filter icon
uk: Значок фільтра

source: Filter
uk: Фільтр

source: Reset icon
uk: Значок скидання

source: Clear filters
uk: Очистити фільтри

source: Date and Time
uk: Дата і час

source: Edit Message
uk: Редагувати повідомлення

source: Add a New Message
uk: Додати нове повідомлення

source: Max 5 files, images will be converted to WebP
uk: До 5 файлів, зображення конвертуються у WebP

source: Comma-separated (tag1, tag2, ...)
uk: Через кому (тег1, тег2, …)

source: Message
uk: Повідомлення

source: No message content
uk: Немає тексту повідомлення

source: Previous
uk: Попереднє

source: Next
uk: Наступне

source: Attachments
uk: Вкладення

source: Image
uk: Зображення

source: Your browser does not support the video tag.
uk: Браузер не підтримує відтворення відео.

source: Your browser does not support the audio tag.
uk: Браузер не підтримує відтворення аудіо.

source: All rights reserved.
uk: Всі права захищені.

source: Switch to English
uk: Перейти на англійську

source: Switch to Ukrainian
uk: Перейти на українську

source: Sign out
uk: Вийти

source: Confirm
uk: Підтвердити

source: Are you sure you want to proceed?
uk: Ти впевнений, що хочеш продовжити?

source: Search Results
uk: Результати пошуку

source: message found across chats.
uk: повідомлення в чатах.

source: Please enter a search query.
uk: Введи пошуковий запит.

source: Please enter a search query or tag.
uk: Введи пошуковий запит або тег.

source: Please enter a tag after #.
uk: Введи тег після #.

source: Please provide a valid date.
uk: Введи правильну дату.

source: Invalid format.
uk: Неправильний формат.

source: Please provide both start and end dates.
uk: Вкажи і початкову, і кінцеву дати.

source: Start date is required.
uk: Потрібно вказати початкову дату.

source: End date is required.
uk: Потрібно вказати кінцеву дату.

source: Start date must be before or equal to end date.
uk: Початкова дата має бути раніше або збігатися з кінцевою.

source: Please select a date filter mode.
uk: Вибери режим фільтрації за датою.

source: Please enter a search query, tag, or select a date filter.
uk: Введи пошуковий запит або тег чи вибери фільтр за датою.

source: Back to Search
uk: Назад до пошуку

source: Back to Chat
uk: Назад до чату
